[
{"job_spec": ["Internship, Data Analyst (Intern) job - Lumentum Operations LLC - Milpitas, CA | Indeed.com"], "job_title": ["Internship, Data Analyst (Intern)"], "job_desc": "   ", "position": "data+analyst"},
{"job_spec": ["Internship, Data Scientist (Intern) job - Lumentum Operations LLC - Milpitas, CA | Indeed.com"], "job_title": ["Internship, Data Scientist (Intern)"], "job_desc": "   ", "position": "data+analyst"},
{"job_spec": ["Junior Data Analyst job - Realogy Corporate - Emeryville, CA | Indeed.com"], "job_title": ["Junior Data Analyst"], "job_desc": "   ", "position": "data+analyst"},
{"job_spec": ["Data Analyst & Developer job - DRYCO Construction, Inc. - Fremont, CA | Indeed.com"], "job_title": ["Data Analyst & Developer"], "job_desc": " \n                $80,000 - $120,000 a year ", "position": "data+analyst"},
{"job_spec": ["Neuroimaging Data Analyst job - Stanford University - Stanford, CA | Indeed.com"], "job_title": ["Neuroimaging Data Analyst"], "job_desc": "   ", "position": "data+analyst"}
][
{"job_spec": ["Junior Data Analyst job - Realogy Corporate - Emeryville, CA | Indeed.com"], "job_title": ["Junior Data Analyst"], "job_desc": " Realogy Corporate          86 reviews  Emeryville, CA    Requisition 51649 \n \n About ZapLabs LLC  \nZapLabs (www.zaplabs.com) is the innovation and technology hub for global real estate leader Realogy Holdings Corp. (NYSE: RLGY), and the driving force behind inventive technology for brokers and agents affiliated with Realogy’s world renowned real estate brands. ZapLabs delivers its highly effective consumer, sales associate and broker solutions in support of Realogy’s leading franchise brands and is positioned to expand the scope of its technology development efforts to encompass Realogy’s other business segments, including residential brokerage, relocation and settlement services. ZapLabs is headquartered in Emeryville, California.   \nJob Title:  Junior Data Analyst  \nAt ZapLabs, we work to build and improve a platform that helps real estate professionals work effectively, and helps delight home buyers and sellers with an excellent experience. We do that by combining great technology with great people – and we’re looking for a  Junior Data Analyst  to join our team.   \nWhat we’re looking for:   \nYou’re a self-proclaimed data geek with killer quantitative skills and some experience in data analysis, and you’re looking to apply those skills with ZapLabs’ data team. You’re excited about working closely with ZapLabs’ data scientists, product managers, engineers, and senior leadership to provide insights and analyses that drive product strategy, innovation, and adoption of our products. Fast-paced environments, details, and a deluge of data all sound like your cup of tea. \n   \nWhat you’ll do:   \nYou’ll acquire, clean, and structure data from multiple sources, including Google Analytics, AdWords, and internal databases, and analyze data to discover and interpret trends, patterns, and relationships .  You’ll monitor and evaluate our search marketing (including SEO and SEM) performance and identify opportunities. Working across departments, you’ll help us ensure data quality and present data in a way that makes it easy to communicate among different groups. You’ll also help the team with ad hoc data requests – and you’ll learn something new every day. \n   \nSkills, accomplishments, &amp; interests you should have:    \nBachelor’s degree in Mathematics, Statistics, Computer Science, Engineering, or other quantitative field from a top educational institution  \n1-3 years of relevant experience preferred; equivalent combination of education and experience will be considered  \nExperience with Google Analytics and SQL  \nHighly analytical and quantitative, with strong attention to detail  \nSelf-starter with excellent written and verbal communication as well as interpersonal skills  \nAbility to thrive in a fast-paced, ambiguous, interruptive environment  \nAbility to work independently as well as work collaboratively toward a common goal    \nNice to haves:    \nAdvanced computer and modeling skills, with high proficiency in Excel modeling, data mining, Python, and scenario analysis  \nExtensive LOTR or Star Wars knowledge   \nTo learn more about Realogy and the accomplishments of our brands, log on to www.realogy.com.  \nRealogy Holdings Corp. is an equal opportunity employer and is committed to diversity in its hiring and business practices. All qualified candidates are encouraged to apply.  \nEOE AA M/F/Vet/Disability  \nZIP123  \n#LI-MW1    Realogy   30+ days ago    -   save job    -  \n                original job   Caissa, LLC  San Francisco, CA  30+ days ago   Easily apply  Realogy Corporate  Emeryville, CA  Realogy  8 days ago  Sandia National Laboratories  Livermore, CA  14 days ago  Rabbit, Inc.  Redwood City, CA  9 days ago   Easily apply  JUUL Labs  San Francisco, CA  30+ days ago            Upload Your Resume     Upload Your Resume  ", "position": "data+analyst"},
{"job_spec": ["Neuroimaging Data Analyst job - Stanford University - Stanford, CA | Indeed.com"], "job_title": ["Neuroimaging Data Analyst"], "job_desc": " Stanford University          456 reviews  Stanford, CA 94305  Full-time, Temporary   The Etkin lab within the Department of Psychiatry and Behavioral Sciences at Stanford University School of Medicine is seeking a Neuroimaging Data Analyst to organize and oversee scientific data in web-based databases. The Neuroimaging Data Analyst will define and maintain processes that evaluate and verify the accuracy of data. The position would also entail ensuring that the data pipeline is continuously working, write code for updated queries, update data dictionaries as new fields are added to the database, and maintain a data correction log.The Etkin Lab aims to understand the neural basis of emotional disorders and their treatment, and to leverage this knowledge to develop novel treatment interventions. The lab’s work is organized around the neuroscientific study of emotion and its regulation in healthy subjects and in individuals with psychiatric disorders. For more information about the Etkin lab please visit their website at: http://etkinlab.stanford.edu/   Duties include:     Assist in the creation of databases and query tools for data mining.  Produce documentation regarding effective use of the database.  Respond to user requests.  Identify and acquire new data for inclusion in the database.  Review submissions to the database for quality and relevancy; abstract information in the required formats  Maintain quality control and integrity of current and archived data.  Conduct independent research of literature and other available research to add content to the database.  Test new functionality with the software  Assist with the preparation of reports and publications about the research progress  Participate in presentations and demonstrations of the database at conferences or other institutions.  Collect and analyze information from peer-reviewed scientific journals and through direct submissions; abstract data into the required format, and verify them for accuracy.   * - Other duties may also be assigned   EDUCATION &amp; EXPERIENCE (REQUIRED):  Bachelor's degree in scientific field and one year of related experience, or combination of relevant experience.   KNOWLEDGE, SKILLS AND ABILITIES (REQUIRED):     Solid analytical skills.    Strong written and oral English communication skills.    Computer skills, including word processing and spreadsheet applications.    Ability to understand scientific literature, experimental procedures and their limitations, and current needs of the research community.    CERTIFICATIONS &amp; LICENSES:  None   PHYSICAL REQUIREMENTS*:     Frequently perform desk based computer tasks, seated work and use light/ fine grasping. Occasionally stand, walk, and write by hand, lift, carry, push pull objects that weigh up to 10 pounds.   * - Consistent with its obligations under the law, the University will provide reasonable accommodation to any employee with a disability who requires accommodation to perform the essential functions of his or her job.   WORKING CONDITIONS:     May work extended or non-standard hours based on project or business needs. Occasional local travel may be required.    Some work may be performed in a laboratory setting.   Job Types: Full-time, Temporary  Experience:   Data Analysis: 1 year (Required)   Education:   Bachelor's (Required)    1 day ago    -   save job     Goodwater Capital  San Mateo, CA  23 hours ago   Easily apply  Stanford University  California  8 days ago  Intuit  Mountain View, CA  9 hours ago  Phoenix Bioinformatics  Fremont, CA  5 days ago   Easily apply  Mayfield Robotics  Redwood City, CA  30+ days ago   Easily apply            Upload Your Resume     Upload Your Resume  ", "position": "data+analyst"},
{"job_spec": ["Internship, Data Analyst (Intern) job - Lumentum Operations LLC - Milpitas, CA | Indeed.com"], "job_title": ["Internship, Data Analyst (Intern)"], "job_desc": " Lumentum Operations LLC          24 reviews  Milpitas, CA  Full-time, Temporary, Internship            Who Are We?  \n Lumentum (NASDAQ: LITE) is a market-leading manufacturer of innovative optical and photonic products enabling optical networking and commercial laser customers worldwide. Lumentum’s optical components and subsystems are part of virtually every type of telecom, enterprise, and data center network. Lumentum’s commercial lasers enable advanced manufacturing techniques and diverse applications including next-generation 3D sensing capabilities. Lumentum is headquartered in Milpitas, California with R&amp;D, manufacturing, and sales offices worldwide. For more information, please visit www.lumentum.com \n  \nLumentum is an Equal Opportunity Employer, EOE/Minorities/Females/Veterans/Individuals with Disability \n   What Will You Do?  \n  \nLumentum, an intense and exciting growing global company, is looking for interns to join our supply chain team. We’re hard-working, smart, goal-oriented, and creative. In this position expect to gain real-world hands on experience in a high tech company and at the same time you will participate in an internship program that includes many exciting activities including lunches with executive team members, presentations, and more.\n   Responsibilities  \n  Own the Agile Hygiene Project pertaining to Suppliers/Manufacturers  \nReview ~8k records of Manufacturers in Agile and update their status accordingly  \nProject may be expanded to include other updates as well  \nWork cross organizationally as needed to collect information\n  Help collect, organize, and present data as needed  \n  Requirements  \n  A minimum of Senior standing towards a Bachelor’s degree in a related field  \nUS Citizenship or Permanent Residency Required for this position  \nExperience with Agile  \nStrong analytic and statistic skills  \nOpen minded and ability to learn new things fast  \nExcellent skills with MS Office (Excel, PowerPoint, Word, etc.)  \nExcellent communication skills, written, verbal, and presentation  \nA desire for continuous self-improvement  \n \n \n         Primary Location  :  US-CA-Milpitas   \nWork Locations  :  Milpitas-HQ, CA USA 400 N McCarthy Blvd Milpitas 95035   \nJob  :  Supply Chain (Generic)   \nOrganization  :  US BU   \nSchedule  :  Full-time   \nEmployee Status  :  Temporary   \nJob Type  :  Internship   \nJob Level  :  Entry Level   \nTravel  :  No   \nJob Posting  :  Apr 19, 2018, 10:03:01 PM    30+ days ago    -   save job    -  \n                original job   KLA-Tencor  Milpitas, CA  20 days ago  Lumentum Operations LLC  Milpitas, CA  30+ days ago  Lumentum Operations LLC  San Jose, CA  30+ days ago  Proofpoint  Sunnyvale, CA  12 days ago  Lumentum Operations LLC  San Jose, CA  30+ days ago            Upload Your Resume     Upload Your Resume  ", "position": "data+analyst"},
{"job_spec": ["Internship, Data Scientist (Intern) job - Lumentum Operations LLC - Milpitas, CA | Indeed.com"], "job_title": ["Internship, Data Scientist (Intern)"], "job_desc": " Lumentum Operations LLC          24 reviews  Milpitas, CA  Full-time, Temporary, Internship      Who Are We?  \n Lumentum (NASDAQ: LITE) is a market-leading manufacturer of innovative optical and photonic products enabling optical networking and commercial laser customers worldwide. Lumentum’s optical components and subsystems are part of virtually every type of telecom, enterprise, and data center network. Lumentum’s commercial lasers enable advanced manufacturing techniques and diverse applications including next-generation 3D sensing capabilities. Lumentum is headquartered in Milpitas, California with R&amp;D, manufacturing, and sales offices worldwide.  \n \n Lumentum is an Equal Opportunity Employer, EOE/Minorities/Females/Veterans/Individuals with Disability  \n \n  What Will You Do?    \n  \n Lumentum is currently transforming the way we look at Quality as a culture. As a part of this transformation effort the Quality team is developing a new functional excellence program. In this assignment you will be a part of the Quality and Functional Excellence team driving new data analytics abilities into the organization. In this position you will gain real-world hands on experience in a high tech company. You will also participate in an internship program that includes many exciting activities including lunches with executive team members, presentations, and more. Duties performed will include but are not limited to: \n \n Acquire new data sets \n Create visual analytics for large data sets \n Develop scripts for automating tasks \n Interpret and analyze data sets for completeness and trends \n Other projects as assigned  \n  Requirements:  \n  Must be a minimum of Senior standing and working towards obtaining a degree in Mathematics, Computer Science, or other related field \n Excellent MS Word, Excel, and PowerPoint skills\n  Tableau (plus) \n Coding Language (Linux, Pearl, Python, R, etc.) \n Creative and innovative mindset \n Collaborative team player \n Excellent oral and written communication skills \n An unusual blend of creative/analytical skills \n Excellent organizational skills with the ability to prioritize tasks \n Ability to manage and meet deadlines \n Ability to exercise good judgment in ambiguous situations   \n   \n  \n    Primary Location  :  US-CA-Milpitas   \nWork Locations  :  Milpitas-HQ, CA USA 400 N McCarthy Blvd Milpitas 95035   \nJob  :  Quality Engineer   \nOrganization  :  US BU   \nSchedule  :  Full-time   \nEmployee Status  :  Temporary   \nJob Type  :  Internship   \nJob Level  :  Entry Level   \nTravel  :  No   \nJob Posting  :  Apr 19, 2018, 9:36:12 PM    30+ days ago    -   save job    -  \n                original job   Kohl's  Milpitas, CA  19 days ago  PDDN INC.  San Jose, CA  1 day ago   Easily apply  CloudCar  Santa Clara, CA  1 day ago   Easily apply  McAfee  Santa Clara, CA  19 hours ago  Akamai  Santa Clara, CA  8 days ago            Upload Your Resume     Upload Your Resume  ", "position": "data+analyst"},
{"job_spec": ["Data Analyst & Developer job - DRYCO Construction, Inc. - Fremont, CA | Indeed.com"], "job_title": ["Data Analyst & Developer"], "job_desc": " DRYCO Construction, Inc.  Fremont, CA 94538  \n                $80,000 - $120,000 a year    DRYCO Construction is now Hiring  a  \"Data Analyst &amp; Developer\" for their amazing Fremont Family   This position brings together multiple roles to guide/streamline the business. You will mine data, determine the important pieces of information, and create an interface to present the information to the management team to verify business direction. You will also administer and make any necessary changes to our current software setup as well as research and decide on new pieces of software that may benefit the business. This position requires that you are able to work very closely with the system software, at a micro level. The ideal candidate will be able to think like both a programmer and business analyst.  You will be expected do perform these duties with very little management. While you will be introduced to the existing setup of our software and reports, you may introduce new tools to customize/visualize the data.   Job Qualifications:     1-2 years CRM administration/configuration experience (experience required in MS Dynamics 365)  1-2 years experience with SQL database design and querying  Bachelor’s degree in a technical field, preferable Computer Science  2-3 years experience deciding on and setting up software according to business needs  1-2 years programming experience (and ability to pick up VBA)  Expert with spreadsheet software (e.g. MS Excel)  Highly proficient with MS Access as a front-end tool  Able to work independently with very little oversight and guidance  Excellent with general problem-solving  Quick learner  Easygoing can-do attitude   **Family Values: DRYCO puts an emphasis on family values and employee loyalty. Many employees have been with  DRYCO  for over 20 years, and many families have multiple generations at  DRYCO  .  *Our company puts an emphasis on work-life balance.   DRYCO  Construction, Inc. has been a leader in the commercial pavement maintenance industry for over 30 years and offers service in The Bay Area, Central Valley, and Northern California.  DRYCO  began as an asphalt paving contractor, but has since added its own concrete, seal coat and striping and fencing divisions.  DRYCO  works with property managers, home owners associations, general contractors, engineering consultants, and building owners to keep their most valuable assets protected and maintained.  Job Type: Full-time  Salary: $80,000.00 to $120,000.00 /year  **We offer competitive pay, full benefit &amp; retirement packages. We are an EEOC employer who offers a drug free workplace.  Job Type: Full-time  Salary: $80,000.00 to $120,000.00 /year  Experience:   MS Dynamics 365: 2 years (Required)  Data Analysis: 3 years (Required)   Education:   Bachelor's (Required)   Language:   English (Required)    9 days ago    -   save job     Tekmark Global Solutions  Palo Alto, CA  10 days ago   Easily apply  NVIDIA  Santa Clara, CA  8 days ago  Decitech Consulting  Fremont, CA  24 days ago   Easily apply  Apple  Santa Clara Valley, CA  12 days ago  Santa Clara County Federal Credit Union  San Jose, CA  7 days ago    Upload Your Resume     Upload Your Resume  ", "position": "data+analyst"}
]