[
{"job_spec": ["Python Software Engineer - Boston, MA job - ADK Group - Boston, MA | Indeed.com"], "job_title": ["Python Software Engineer - Boston, MA"], "job_desc": "  ADK Group is a Boston-based digital agency and application development company for some of the area’s most well-known organizations. We provide critical technical solutions for a wide variety of companies - from Fortune 500’s to non-profit organizations and everything in between. Our employees share diverse technical skill sets and excel in taking ownership of their projects. Successful employees will have an unwavering commitment and motivation to take projects from functional requirements to fully functioning, interactive applications for our clients. Our growth is significant and we are looking to add several new members to our team.  We are specifically looking for a “Mid-to Senior” level engineer with at least three years of back-end development experience. This position will focus primarily on back-end development with Python - though a demonstrable familiarity with front-end technologies is a plus. Strong candidates will possess an advanced understanding of computer science fundamentals and demonstrable experience in executing the full software development life-cycle – from concept to completion. Additional requirements include RESTful API design, relational database design principles, and strong debugging skills. Experience in a fast-paced, team-based environment is crucial as successful employees are constantly collaborating with colleagues to bridge the gap between functional requirements and technical implementation.  Unfortunately, ADK Group is not in a position to consider candidates requiring visa sponsorships or transfers.   Must Have Skills    Three years of hands-on development with server-side languages – namely, Python.  Ability to execute the full software life-cycle development process - from architecture and development to debugging and maintenance. This is crucial.  Advanced understanding of C.S. fundamentals (data structures, algorithms, object-oriented design)  Strong experience in RESTful API design and implementation  Relational Database design expertise  Familiarity with HTML, CSS, and JavaScript    Nice To Have    Familiarity with React.js and React Native  Ability to work in both Agile and Waterfall environments.   To apply, please visit  https://adkgroup.bamboohr.com/jobs/view.php?id=32  .   Compensation, Benefits and Perks    Competitive market salary  401k matching  Flexible work environment at a state of the art, centrally located facility  Comprehensive medical and dental coverage  Student loan repayment program  Diverse fitness benefits - discounted rates at Boston Sports Clubs and Everybody Fights (boxing!)  Significant internal growth opportunities (we’re growing quickly!)  Professional development opportunities  Two beautiful Greyhounds walking about the office supporting staff   Job Type: Full-time  Experience:   Software Development: 3 years (Required)   Education:   Bachelor's (Required)   Job Location:   Boston, MA (Required)   ", "songTitle": "python"},
{"job_spec": ["Site Reliability Engineer job - Interactions LLC - Franklin, MA | Indeed.com"], "job_title": ["Site Reliability Engineer"], "job_desc": "   ", "songTitle": "python"},
{"job_spec": ["Image Analyst job - Invicro - Boston, MA | Indeed.com"], "job_title": ["Image Analyst"], "job_desc": "   ", "songTitle": "python"},
{"job_spec": ["Developer I, Research S'ware job - Boston Children's Hospital - Boston, MA | Indeed.com"], "job_title": ["Developer I, Research S'ware"], "job_desc": "   ", "songTitle": "python"},
{"job_spec": ["Database Specialist job - Gradient - Cambridge, MA | Indeed.com"], "job_title": ["Database Specialist"], "job_desc": "  Gradient, an environmental consulting firm located in Harvard Square, is seeking a highly qualified, motivated data scientist. The ideal candidate must be able to apply relevant skills in database design and management, programming, and/or data visualization to a diverse range of environmental project settings. Excellent communication skills are required.  Position requires a degree in engineering, natural sciences, or related field. Previous relevant experience is a plus. Candidate should have experience with environmental data and database systems (MS SQL Server, PostgreSQL, Oracle, MS Access). Expertise with relational databases such as EQuIS and/or ArcSDE preferred. Programming and/or coding experience (  e.g  ., Python, Numpy, Scipy, Matplotlib, Pandas, Django, JavaScript) a plus.  Job Type: Full-time  Education:   Master's (Preferred)   ", "songTitle": "python"},
{"job_spec": ["Python Instructor job - Coding Temple - Boston, MA | Indeed.com"], "job_title": ["Python Instructor"], "job_desc": "  If you live and breathe code as your craft and find joy in helping other people learn, Coding Temple is an ideal fit for you.   What we believe in:    First and most importantly, here are a few of our values when it comes to teaching someone how to be a developer:   Problem solving over syntax - We believe syntax is the easy part of programming, whereas learning to think like an engineer is one of the most important skills we can teach.    Quality over quantity – We’re interested in training true professionals, not getting as many people into our classes as possible. We emphasize small class sizes and value personal interactions with students.    Real projects over tests – People learn programming best by tackling hard problems with a mentor, not following a list of steps or taking a quiz.    Emphasis on open source – We deeply value the open source mindset and teach our students the importance of using and contributing to the open source ecosystem.    What the role and responsibilities look like:    As an instructor, you will serve as a lecturer and mentors to our students, helping them learn to think like engineers and hone their skills as a programmer. Our courses do not replace a Computer Science degree, but as an instructor, it is your job to ensure students know enough to compete in the job market. You’ll also help refine the curriculum to stay current with emerging tools and technology. Our maximum class size is 10 students, and there are additional staff members on-hand to assist with the running the program. Outside of class, you’re expected to be an active part of the development community in your city (hopefully you already are), and you may be required to act as a spokesperson for Coding Temple’s programs at events.   Requirements    Your qualities and experience:     Self-starter who takes ownership of your role    2+ years of professional web development experience    Written and verbal communication skills.    Knowledge and experience with Python and JavaScript    Knowledge of Object Oriented Design concepts    Knowledge of Data Structures and Algorithms.    Experience with Django or other Python web framework.    Experience with MySql, PostgreSQL, or other data management system.    Comfortable leading fluid discussions: the ability to work off of the scripted lecture to give dynamic, real world examples.    Experience working in a project management framework.    High level of empathy and patience when working with students.    Open and honest communication with staff and students    You are capable of offering career guidance based on your own experiences and observations.    Compensation and benefits    Competitive full-time salary    Relaxed working environment (casual attire, free food, ping-pong table)    A one-week “break” between each ten-week course (can be used for Paid Time Off or professional development), up to two weeks of additional Paid Time Off.   Job Type: Full-time  Education:   Bachelor's (Required)   ", "songTitle": "python"}
]